## Plan Result (sbox-global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 14 to change, 2 to destroy.</code></pre>

* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cft-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;labs-goldenpath-felix&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;labs-louisehuyton-walkthrough&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;labs-ozzyib-walkthrough&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;labs-zcwalkthrough-nodejs&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;plum&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
* Delete
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;labs-goldenpath-tyler&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;labs-goldenpath-tyler&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox"
        name                                 = "hmcts-sbox"
      ~ tags                                 = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

      - backend_pool {
          - health_probe_name   = "healthProbeSettings-labs-goldenpath-tyler" -> null
          - id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/backendPools/labs-goldenpath-tyler" -> null
          - load_balancing_name = "loadBalancingSettings-labs-goldenpath-tyler" -> null
          - name                = "labs-goldenpath-tyler" -> null

          - backend {
              - address     = "firewall-sbox-int-palo-labsgoldenpathtyler.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "labs-goldenpath-tyler.sandbox.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }

      - backend_pool_health_probe {
          - enabled             = true -> null
          - id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/healthProbeSettings/healthProbeSettings-labs-goldenpath-tyler" -> null
          - interval_in_seconds = 120 -> null
          - name                = "healthProbeSettings-labs-goldenpath-tyler" -> null
          - path                = "/health/liveness" -> null
          - probe_method        = "GET" -> null
          - protocol            = "Http" -> null
        }

      - backend_pool_load_balancing {
          - additional_latency_milliseconds = 0 -> null
          - id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/loadBalancingSettings/loadBalancingSettings-labs-goldenpath-tyler" -> null
          - name                            = "loadBalancingSettings-labs-goldenpath-tyler" -> null
          - sample_size                     = 4 -> null
          - successful_samples_required     = 2 -> null
        }

      - frontend_endpoint {
          - host_name                               = "labs-goldenpath-tyler.sandbox.platform.hmcts.net" -> null
          - id                                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/labs-goldenpath-tyler" -> null
          - name                                    = "labs-goldenpath-tyler" -> null
          - session_affinity_enabled                = false -> null
          - session_affinity_ttl_seconds            = 0 -> null
          - web_application_firewall_policy_link_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labsgoldenpathtylersbox" -> null
        }

      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "labs-goldenpath-tyler",
              + "idam-web-public",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-goldenpath-tyler"
          ~ name               = "labs-goldenpath-tyler" -> "idam-web-publicHttpsRedirect"
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "labs-goldenpath-tyler" -> null
              - cache_enabled                         = true -> null
              - cache_query_parameter_strip_directive = "StripNone" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-public",
              + "hmcts-access",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-web-publicHttpsRedirect"
          ~ name               = "idam-web-publicHttpsRedirect" -> "hmcts-accessHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmcts-access",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/hmcts-accessHttpsRedirect"
          ~ name               = "hmcts-accessHttpsRedirect" -> "idam-web-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-web-adminHttpsRedirect"
          ~ name               = "idam-web-adminHttpsRedirect" -> "idam-user-dashboardHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "plum",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/idam-user-dashboardHttpsRedirect"
          ~ name               = "idam-user-dashboardHttpsRedirect" -> "plumHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "plum",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/plumHttpsRedirect"
          ~ name               = "plumHttpsRedirect" -> "hmi-apimHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/hmi-apimHttpsRedirect"
          ~ name               = "hmi-apimHttpsRedirect" -> "cft-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "reformscan",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/cft-api-mgmtHttpsRedirect"
          ~ name               = "cft-api-mgmtHttpsRedirect" -> "reformscanHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "reformscan",
              + "labs-louisehuyton-walkthrough",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/reformscanHttpsRedirect"
          ~ name               = "reformscanHttpsRedirect" -> "labs-louisehuyton-walkthroughHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "labs-louisehuyton-walkthrough",
              + "labs-ozzyib-walkthrough",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-louisehuyton-walkthroughHttpsRedirect"
          ~ name               = "labs-louisehuyton-walkthroughHttpsRedirect" -> "labs-ozzyib-walkthroughHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "labs-ozzyib-walkthrough",
              + "labs-zcwalkthrough-nodejs",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-ozzyib-walkthroughHttpsRedirect"
          ~ name               = "labs-ozzyib-walkthroughHttpsRedirect" -> "labs-zcwalkthrough-nodejsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "labs-zcwalkthrough-nodejs",
              + "labs-goldenpath-felix",
            ]
            id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-zcwalkthrough-nodejsHttpsRedirect"
          ~ name               = "labs-zcwalkthrough-nodejsHttpsRedirect" -> "labs-goldenpath-felixHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "labs-goldenpath-felix",
            ] -> null
          - id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-goldenpath-felixHttpsRedirect" -> null
          - name               = "labs-goldenpath-felixHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "labs-goldenpath-tyler",
            ] -> null
          - id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/routingRules/labs-goldenpath-tylerHttpsRedirect" -> null
          - name               = "labs-goldenpath-tylerHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }

        # (67 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["labs-goldenpath-tyler"] will be destroyed
  # (because key ["labs-goldenpath-tyler"] is not in for_each map)
  - resource "azurerm_frontdoor_custom_https_configuration" "https" {
      - custom_https_provisioning_enabled = true -> null
      - frontend_endpoint_id              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/frontendEndpoints/labs-goldenpath-tyler" -> null
      - id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox/customHttpsConfiguration/labs-goldenpath-tyler" -> null

      - custom_https_configuration {
          - certificate_source    = "FrontDoor" -> null
          - minimum_tls_version   = "1.2" -> null
          - provisioning_state    = "Enabled" -> null
          - provisioning_substate = "CertificateDeployed" -> null
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["cft-api-mgmt"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/cftapimgmtsbox"
        name                              = "cftapimgmtsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmcts-access"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmctsaccesssbox"
        name                              = "hmctsaccesssbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmi-apim"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmiapimsbox"
        name                              = "hmiapimsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-user-dashboard"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamuserdashboardsbox"
        name                              = "idamuserdashboardsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-web-admin"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebadminsbox"
        name                              = "idamwebadminsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-web-public"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebpublicsbox"
        name                              = "idamwebpublicsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["labs-goldenpath-felix"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labsgoldenpathfelixsbox"
        name                              = "labsgoldenpathfelixsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["labs-goldenpath-tyler"] will be destroyed
  # (because key ["labs-goldenpath-tyler"] is not in for_each map)
  - resource "azurerm_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [
          - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourcegroups/lz-sbox-rg/providers/Microsoft.Network/frontdoors/hmcts-sbox/frontendendpoints/labs-goldenpath-tyler",
        ] -> null
      - id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labsgoldenpathtylersbox" -> null
      - location                          = "global" -> null
      - mode                              = "Prevention" -> null
      - name                              = "labsgoldenpathtylersbox" -> null
      - resource_group_name               = "lz-sbox-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "Sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null

      - managed_rule {
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["labs-louisehuyton-walkthrough"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labslouisehuytonwalkthroughsbox"
        name                              = "labslouisehuytonwalkthroughsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["labs-ozzyib-walkthrough"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labsozzyibwalkthroughsbox"
        name                              = "labsozzyibwalkthroughsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["labs-zcwalkthrough-nodejs"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labszcwalkthroughnodejssbox"
        name                              = "labszcwalkthroughnodejssbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["plum"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/plumsbox"
        name                              = "plumsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["reformscan"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/reformscansbox"
        name                              = "reformscansbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 14 to change, 2 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["labs-goldenpath-tyler"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourcegroups/lz-sbox-rg/providers/Microsoft.Network/frontdoors/hmcts-sbox/frontendendpoints/labs-goldenpath-tyler",
        ]
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labsgoldenpathtylersbox"
        name                              = "labsgoldenpathtylersbox"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "Sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1447,"Program":"tfcmt","SHA1":"","Target":"sbox-global","Vars":{}} -->